UCLM-ESI/wemos-d1-r32-pio/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

//              Arduino  WEMOS
// SW1             D2      26
// SW2             D3      25
// buzzer          D5      16
// IR              D6      27
// RGB red         D9      13
// RGB green       D11      5
// RGB blue        D10     23
// LED4 (red)      D12     19
// LED3 (blue)     D13     18

// pontenciometer  A0       2
// LDR             A1       4
// temperarture    A2      36

#include <stdint.h>

#define EXTERNAL_NUM_INTERRUPTS 16
#define NUM_DIGITAL_PINS        40
#define NUM_ANALOG_INPUTS       16

#define analogInputToDigitalPin(p)  (((p)<20)?(esp32_adc2gpio[(p)]):-1)
#define digitalPinToInterrupt(p)    (((p)<40)?(p):-1)
#define digitalPinHasPWM(p)         (p < 34)

static const uint8_t LED_BUILTIN = 2;
#define BUILTIN_LED  LED_BUILTIN // backward compatibility

/* static const uint8_t TX = 1; */
/* static const uint8_t RX = 3; */

/* static const uint8_t SDA = 21; */
/* static const uint8_t SCL = 22; */

/* static const uint8_t SS    = 5; */
/* static const uint8_t MOSI  = 23; */
/* static const uint8_t MISO  = 19; */
/* static const uint8_t SCK   = 18; */

static const uint8_t D2 =  26;
static const uint8_t D3 =  25;
static const uint8_t D5 =  16;
static const uint8_t D6 =  27;
static const uint8_t D9 = 13;
static const uint8_t D10 = 5;
static const uint8_t D11 = 23;
static const uint8_t D12 = 19;
static const uint8_t D13 = 18;

static const uint8_t A0 = 2;
static const uint8_t A1 = 4;
static const uint8_t A2 = 36;

/* static const uint8_t A3 = 39; */
/* static const uint8_t A4 = 32; */
/* static const uint8_t A5 = 33; */
/* static const uint8_t A6 = 34; */
/* static const uint8_t A7 = 35; */
/* static const uint8_t A10 = 4; */
/* static const uint8_t A11 = 0; */
/* static const uint8_t A12 = 2; */
/* static const uint8_t A13 = 15; */
/* static const uint8_t A14 = 13; */
/* static const uint8_t A15 = 12; */
/* static const uint8_t A16 = 14; */
/* static const uint8_t A17 = 27; */
/* static const uint8_t A18 = 25; */
/* static const uint8_t A19 = 26; */

/* static const uint8_t T0 = 4; */
/* static const uint8_t T1 = 0; */
/* static const uint8_t T2 = 2; */
/* static const uint8_t T3 = 15; */
/* static const uint8_t T4 = 13; */
/* static const uint8_t T5 = 12; */
/* static const uint8_t T6 = 14; */
/* static const uint8_t T7 = 27; */
/* static const uint8_t T8 = 33; */
/* static const uint8_t T9 = 32; */

/* static const uint8_t DAC1 = 25; */
/* static const uint8_t DAC2 = 26; */

#endif /* Pins_Arduino_h */
